## Connect with database

In [1]:
import sqlite3

db = sqlite3.connect('IMDB.sqlite')
db

In [9]:
db = sqlite3.connect('IMDB_1.sqlite')
db

In [10]:
db = sqlite3.connect('School.sqlite')
db

In [11]:
cur = db.cursor()
cur

In [12]:
sql_query = 'Create table Student (RollNumber int Primary key, Name Text, Age int)'
cur.execute(sql_query)

In [13]:
cur.execute('Insert into Student values (101, "Aman", 20)')

In [14]:
db.commit()

In [16]:
cur.execute('Insert into Student values (102, "Amit", 21)')

In [17]:
db.commit()

In [18]:
db.close()

In [19]:
cur.execute('Insert into Student values (102, "Amit", 21)')

ProgrammingError: Cannot operate on a closed database.

## Passing parameters in query

In [ ]:
import sqlite3
db = sqlite3.connect('School.sqlite')
db

In [ ]:
cur = db.cursor()
cur

In [ ]:
cur.execute('Insert into Student values (103, "Mohit", 24)')

In [ ]:
db.commit()

In [ ]:
rollNumber = 104
Name = "Nikhil"
age = 34

cur.execute('Insert into Student values (?, ?, ?)', (rollNumber, Name, age))

In [ ]:
db.commit()

In [ ]:
values = [(105, "Nidhi", 20), (106, "Manisha", 21), (107, "Ankush", 22)]
cur.executemany('Insert into Student values (?, ?, ?)', values)

In [ ]:
db.commit()

In [ ]:
cur.execute('Update Student set Age = 30')

In [ ]:
db.commit()

In [ ]:
cur.execute('Update Student set Age = 20 where RollNumber = 102')
db.commit()

In [ ]:
new_age = 50
cur.execute('Update Student set Age = ? where RollNumber = 103', (new_age, ))

In [ ]:
db.commit()

## SQLite with Pandas

In [ ]:
import sqlite3
import pandas as pd

db = sqlite3.connect('School.sqlite')

In [ ]:
data = pd.read_sql_query("Select * from Student", db)
data

   RollNumber     Name  Age
0         101     Aman   30
1         102     Amit   20
2         103    Mohit   50
3         104   Nikhil   30
4         105    Nidhi   30
5         106  Manisha   30
6         107   Ankush   30

In [ ]:
data[data['Age'] == 30]

   RollNumber     Name  Age
0         101     Aman   30
3         104   Nikhil   30
4         105    Nidhi   30
5         106  Manisha   30
6         107   Ankush   30

In [ ]:
data = pd.DataFrame([[201, "Aman", "English", 20000], [202, "Komal", "Maths", 22000], [203, "Mahesh", "Science", 23000]], 
                   columns = ["ID", "Name", "Course", "Salary"])
data

    ID    Name   Course  Salary
0  201    Aman  English   20000
1  202   Komal    Maths   22000
2  203  Mahesh  Science   23000

In [ ]:
data.to_sql("Faculty", db)

In [ ]:
data = pd.read_sql_query("Select * from Student", db)
data["Address"] = "Test"
data.to_sql("Student", db, if_exists = "replace")